       01 ARQCRM-REGISTRO.
           05 ARQCRM-CHAVE.
              10 ARQCRM-ID           PIC X(04).
           05 ARQCRM-NOME            PIC X(25).
           05 ARQCRM-EMAIL           PIC X(30).
           05 ARQCRM-TELEFONE        PIC X(14).
           05 ARQCRM-STATUS          PIC 9(01).
              