         77 WRK-VALOR     PIC 9(06)V99   VALUES ZEROS.
         77 WRK-MES       PIC 9(02)      VALUES ZEROS.
         77 WRK-JUROS     PIC 9(03)V99   VALUES ZEROS.
         77 WRK-TOTAL-ED  PIC $.ZZZ.ZZ9,99 VALUE ZEROS.
         77 WRK-VALOR-DEC PIC 9(06)V9999 VALUE ZEROS.
         77 WRK-DADO-OK   PIC X(03)       VALUES 'NAO'.