       IDENTIFICATION DIVISION.
       PROGRAM-ID.  PROGCOBFOLHA.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       
       77 LOJA1 PIC 9(04)V99.
       77 LOJA2 PIC 9(04)V99.
       77 TOTAL PIC 9(04)V99.

       PROCEDURE DIVISION.

       MOVE 1023.45 TO LOJA1.
       MOVE 807.55  TO LOJA2.
           COMPUTE TOTAL = LOJA1 + LOJA2.

       DISPLAY "SOMA DAS VENDAS: R$" TOTAL.

       STOP RUN.    