       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGCOBDEPO.
 
       DATA DIVISION.
       WORKING-STORAGE SECTION.
 
       01 DEPOSITO1.
          05 PRODUTO-A  PIC 9(3).
          05 PRODUTO-B  PIC 9(3).
          05 PRODUTO-C  PIC 9(3).
 
       01 DEPOSITO2.
          05 PRODUTO-A  PIC 9(3).
          05 PRODUTO-B  PIC 9(3).
          05 PRODUTO-C  PIC 9(3).
 
       01 TOTAL.
          05 PRODUTO-A  PIC 9(3).
          05 PRODUTO-B  PIC 9(3).
          05 PRODUTO-C  PIC 9(3).
 
       PROCEDURE DIVISION.
           MOVE 10 TO PRODUTO-A OF DEPOSITO1.
           MOVE 15 TO PRODUTO-B OF DEPOSITO1.
           MOVE 20 TO PRODUTO-C OF DEPOSITO1.
 
           MOVE 5 TO PRODUTO-A OF DEPOSITO2.
           MOVE 10 TO PRODUTO-B OF DEPOSITO2.
           MOVE 5 TO PRODUTO-C OF DEPOSITO2.
 
           COMPUTE PRODUTO-A OF TOTAL = PRODUTO-A OF 
           DEPOSITO1 + PRODUTO-A OF DEPOSITO2.
           COMPUTE PRODUTO-B OF TOTAL = PRODUTO-B OF 
           DEPOSITO1 + PRODUTO-B OF DEPOSITO2.
           COMPUTE PRODUTO-C OF TOTAL = PRODUTO-C OF 
           DEPOSITO1 + PRODUTO-C OF DEPOSITO2.
 
           DISPLAY "TOTAL A: " PRODUTO-A OF TOTAL.
           DISPLAY "TOTAL B: " PRODUTO-B OF TOTAL.
           DISPLAY "TOTAL C: " PRODUTO-C OF TOTAL.
 
           STOP RUN.