       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGCOBVALOR.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.  

       77 VALOR PIC S9(04)V99.

       PROCEDURE DIVISION.
       
       MOVE 1450.75 TO VALOR.

       DISPLAY "SALDO: R$" VALOR.

       STOP RUN.