       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGCOB01.
      *********************************
      *AREA DE COMENTARIOS - REMARKS***
      *AUTHOR = VINICIUS(ALTAFINI)*****
      *OBJETIVO: MOSTRAR A STRING HELLO WORLD!
      *DATA   = 03/03/2026 
      *********************************
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       PROCEDURE  DIVISION.
           DISPLAY "Hello World!".
           STOP RUN.