       IDENTIFICATION DIVISION.
       PROGRAM-ID.  PROGCOBCONTA.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       
       01 FUNCIONARIO.
           05 NOME         PIC X(30).
           05 DEPARTAMENTO PIC X(03).
           05 SALARIO      PIC 9(04)V99.
           05 IMPOSTO      PIC 9(04)V99.

       PROCEDURE DIVISION.

       MOVE "LUCAS" TO NOME.
       MOVE "RH1"   TO DEPARTAMENTO.
       MOVE 3200.50 TO SALARIO.
       MOVE 480.08  TO IMPOSTO.

       DISPLAY "FUNCIONARIO: "  NOME.
       DISPLAY "DEPARTAMENTO: " DEPARTAMENTO.
       DISPLAY "SALARIO: R$"    SALARIO. 
       DISPLAY "IMPOSTO: R$"    IMPOSTO.
       
       STOP RUN.    