       IDENTIFICATION DIVISION.
       PROGRAM-ID. ATIVIDADE07.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77 VALOR-FATURA PIC Z(4)9,99.
 
       PROCEDURE DIVISION.
           MOVE 235,40 TO VALOR-FATURA
           DISPLAY "TOTAL DA FATURA:  " VALOR-FATURA
           
           STOP RUN.