       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGVENDAS.
      *********************************
      *AREA DE COMENTARIOS - REMARKS***
      *AUTHOR = VINICIUS(ALTAFINI)*****
      *OBJETIVO: RECEBER E IMPRIMIR A DATA DO SISTEMA
      *UTILIZAR VARIAVEL TIPO TABELA - OCCURS
      *DATA   = 13/03/2026 
      *********************************
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WRK-MESES.
           03 WRK-MES PIC 9(6)V99 OCCURS 12 TIMES.
       77 WRK-MESVENDA  PIC 9(2)           VALUE ZEROS.
       77 WRK-VALOR     PIC 9(06)V99       VALUE ZEROS.
       01 DATASYS.
          02 WRK-ANOSYS PIC 9(04) VALUES ZEROS.
          02 WRK-MESSYS PIC 9(02) VALUES ZEROS.
          02 WRK-DIASYS PIC 9(02) VALUES ZEROS.    
       PROCEDURE  DIVISION.

       0001-PRINCIPAL.
            PERFORM 0100-INICIALIZAR.
            PERFORM 0200-PROCESSAR UNTIL WRK-MESVENDA EQUAL 99.
            PERFORM 0300-FINALIZAR.
            STOP RUN.
       
      0100-INICIALIZAR.
           DISPLAY 'MES DA VENDA  '.
           ACCEPT WRK-MESVENDA.
           IF WRK-MESVENDA NOT EQUAL 99
             DISPLAY 'VALOR DA VENDA '
             ACCEPT WRK-VALOR
             ADD WRK-VALOR TO WRK-MES(WRK-MESVENDA)
           END-IF.


      0200-PROCESSAR.
           PERFORM 0100-INICIALIZAR.
      0300-FINALIZAR.
           PERFORM VARYING WRK-MESVENDA FROM 1 BY 1
                    UNTIL WRK-MESVENDA > 12
           DISPLAY 'VALOR MES ' WRK-MESVENDA ' = ' WRK-MES(WRK-MESVENDA)
           END-PERFORM.