       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGCOBCLIENTE.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.  
       
       01 CLIENTE-ORIGEM.
           05 WRK-NOME  PIC X(30).
           05 WRK-IDADE PIC 9(03).
       01 CLIENTE-DESTINO.
           05 WRK-NOME  PIC X(30).
           05 WRK-IDADE PIC 9(03).    
       PROCEDURE DIVISION.

       MOVE "ANA" TO WRK-NOME OF CLIENTE-ORIGEM.
       MOVE 32 TO WRK-IDADE OF CLIENTE-ORIGEM.

       MOVE CORRESPONDING CLIENTE-ORIGEM TO CLIENTE-DESTINO.

       DISPLAY "DESTINO - " WRK-NOME OF CLIENTE-DESTINO.
       DISPLAY "DESTINO - " WRK-IDADE  OF CLIENTE-DESTINO.

       STOP RUN.