       IDENTIFICATION DIVISION.
       PROGRAM-ID.  PROGCOBFUNC.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       
       77 WRK-NOME   PIC X(30).
       77 WRK-CODIGO PIC 9(04).
       
       PROCEDURE DIVISION.

       MOVE "JOANA SILVA" TO WRK-NOME.
       MOVE 1023 TO WRK-CODIGO.

       DISPLAY "NOME: " WRK-NOME "CODIGO: " WRK-CODIGO.

       STOP RUN.
