       IDENTIFICATION DIVISION.
       PROGRAM-ID. TESTE.
      *********************************
      *AREA DE COMENTARIOS - REMARKS***
      *AUTHOR = VINICIUS(ALTAFINI)*****
      *OBJETIVO: TESTANDO A FUNCIONALIDADE DO VARYING
      *DATA   = 16/03/2026 
      *********************************
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77 WRK-CONTADOR PIC 9(02) VALUES 0.
       77 WRK-TEMP  PIC 9(02) VALUES 21.

       PROCEDURE  DIVISION.

       0200-PROCESSAR.
       PERFORM 0300-FINALIZAR VARYING WRK-CONTADOR 
           FROM 1 BY 1 UNTIL  WRK-CONTADOR = 21

       PERFORM 0300-FINALIZAR VARYING WRK-TEMP
           FROM 20 BY -1 UNTIL WRK-TEMP = 0

       STOP RUN.   
        

       0300-FINALIZAR.
           DISPLAY 'CONTAGEM: ' WRK-CONTADOR.
           DISPLAY 'AO CONTRARIO: ' WRK-TEMP.