       IDENTIFICATION DIVISION.
       PROGRAM-ID. SIMULAIMPOSTO.

       ENVIRONMENT DIVISION.

       DATA DIVISION.
       WORKING-STORAGE SECTION.

       01 SALARIO PIC 9(04)V99 VALUES ZEROS.
          
       PROCEDURE DIVISION.
           DISPLAY "Digite o seu salario: ".
           ACCEPT  SALARIO.
           CALL "CALCULAIMPOSTO" USING SALARIO.
           STOP RUN.
